For each entity set:
    
    1. add column names
    
    2. find columns contain null value
    
    3. change null as int: -1, text: 'unknown', timestamp: '1970-01-01 00:00:00'

In [2]:
import pandas as pd

In [5]:
warehouse = pd.read_csv('warehouse.csv', header=None)

In [6]:
warehouse.columns = ['w_id', 'w_name', 'w_street_1', 'w_street_2', 'w_city', 'w_state', 'w_zip', 'w_tax', 'w_ytd']

In [7]:
warehouse.isna().any()

w_id          False
w_name        False
w_street_1    False
w_street_2    False
w_city        False
w_state       False
w_zip         False
w_tax         False
w_ytd         False
dtype: bool

In [8]:
district = pd.read_csv('district.csv', header=None)

In [9]:
district.columns = ['d_w_id', 'd_id', 'd_name', 'd_street_1', 'd_street_2', 'd_city', 'd_state', 'd_zip', 'd_tax',
                   'd_ytd', 'd_next_o_id']

In [10]:
district.isna().any()

d_w_id         False
d_id           False
d_name         False
d_street_1     False
d_street_2     False
d_city         False
d_state        False
d_zip          False
d_tax          False
d_ytd          False
d_next_o_id    False
dtype: bool

In [11]:
customer = pd.read_csv('customer.csv', header=None)

In [12]:
customer.columns = ['c_w_id', 'c_d_id', 'c_id', 'c_first', 'c_middle', 'c_last', 'c_street_1', 'c_street_2', 'c_city',
                   'c_state', 'c_zip', 'c_phone', 'c_since', 'c_credit', 'c_credit_lim', 'c_discount', 'c_balance', 
                   'c_ytd_payment', 'c_payment_cnt', 'c_delivery_cnt', 'c_data']

In [13]:
customer.isna().any()

c_w_id            False
c_d_id            False
c_id              False
c_first           False
c_middle          False
c_last            False
c_street_1        False
c_street_2        False
c_city            False
c_state            True
c_zip             False
c_phone           False
c_since           False
c_credit          False
c_credit_lim      False
c_discount        False
c_balance         False
c_ytd_payment     False
c_payment_cnt     False
c_delivery_cnt    False
c_data            False
dtype: bool

In [14]:
customer['c_state'] = customer['c_state'].fillna('unknown')

In [15]:
orders = pd.read_csv('order.csv', header=None)

In [16]:
orders.columns = ['o_w_id', 'o_d_id', 'o_id', 'o_c_id', 'o_carrier_id', 'o_ol_cnt', 'o_all_local', 'o_entry_d']

In [17]:
orders.isna().any()

o_w_id          False
o_d_id          False
o_id            False
o_c_id          False
o_carrier_id     True
o_ol_cnt        False
o_all_local     False
o_entry_d       False
dtype: bool

In [18]:
orders['o_carrier_id'] = orders['o_carrier_id'].fillna(-1)

In [4]:
orders = orders.astype({"o_carrier_id": int})

In [19]:
item = pd.read_csv('item.csv', header=None)

In [20]:
item.columns = ['i_id', 'i_name', 'i_price', 'i_im_id', 'i_data']

In [21]:
item.isna().any()

i_id       False
i_name     False
i_price    False
i_im_id    False
i_data     False
dtype: bool

In [22]:
order_line = pd.read_csv('order-line.csv', header=None)

In [23]:
order_line.columns = ['ol_w_id', 'ol_d_id', 'ol_o_id', 'ol_number', 'ol_i_id', 'ol_delivery_d', 'ol_amount', 'ol_supply_w_id',
                     'ol_quantity', 'ol_dist_info']

In [24]:
order_line.isna().any()

ol_w_id           False
ol_d_id           False
ol_o_id           False
ol_number         False
ol_i_id           False
ol_delivery_d      True
ol_amount         False
ol_supply_w_id    False
ol_quantity       False
ol_dist_info      False
dtype: bool

In [25]:
order_line

,ol_w_id,ol_d_id,ol_o_id,ol_number,ol_i_id,ol_delivery_d,ol_amount,ol_supply_w_id,ol_quantity,ol_dist_info
0,1,1,1,1,20822,2021-08-27 09:50:32.527,0.00,1,5,fjuwillmmaqaqzbqesyifas
1,1,1,1,2,62266,2021-08-27 09:50:32.527,0.00,1,5,bbooaqpuuddhkyqephoaszo
2,1,1,1,3,47297,2021-08-27 09:50:32.527,0.00,1,5,zfzmqutfxfvqpldlsjqbivz
3,1,1,1,4,61218,2021-08-27 09:50:32.527,0.00,1,5,ochisuyvhtrtocfyifwyydd
4,1,1,1,5,57008,2021-08-27 09:50:32.527,0.00,1,5,gfchgbullzaliifvmkueqgw
...,...,...,...,...,...,...,...,...,...,...
3748844,10,10,3000,15,58777,NaN,5295.01,10,5,ygegziqpgynjkubufakampl
3748845,10,10,3000,16,91714,NaN,7251.23,10,5,knzjapuugkjhpkbcgkonujc
3748846,10,10,3000,17,43811,NaN,2327.84,10,5,qrgnecokgbyqxjutulssekx
3748847,10,10,3000,18,98169,NaN,2874.15,10,5,hfefxneahqjjhfzxkoxqjqp
3748848,10,10,3000,19,96498,NaN,5730.80,10,5,hytcvvkpsxyuzimaffbesvm

In [26]:
order_line['ol_delivery_d'] = order_line['ol_delivery_d'].fillna(pd.Timestamp(0))

In [27]:
order_line

,ol_w_id,ol_d_id,ol_o_id,ol_number,ol_i_id,ol_delivery_d,ol_amount,ol_supply_w_id,ol_quantity,ol_dist_info
0,1,1,1,1,20822,2021-08-27 09:50:32.527,0.00,1,5,fjuwillmmaqaqzbqesyifas
1,1,1,1,2,62266,2021-08-27 09:50:32.527,0.00,1,5,bbooaqpuuddhkyqephoaszo
2,1,1,1,3,47297,2021-08-27 09:50:32.527,0.00,1,5,zfzmqutfxfvqpldlsjqbivz
3,1,1,1,4,61218,2021-08-27 09:50:32.527,0.00,1,5,ochisuyvhtrtocfyifwyydd
4,1,1,1,5,57008,2021-08-27 09:50:32.527,0.00,1,5,gfchgbullzaliifvmkueqgw
...,...,...,...,...,...,...,...,...,...,...
3748844,10,10,3000,15,58777,1970-01-01 00:00:00,5295.01,10,5,ygegziqpgynjkubufakampl
3748845,10,10,3000,16,91714,1970-01-01 00:00:00,7251.23,10,5,knzjapuugkjhpkbcgkonujc
3748846,10,10,3000,17,43811,1970-01-01 00:00:00,2327.84,10,5,qrgnecokgbyqxjutulssekx
3748847,10,10,3000,18,98169,1970-01-01 00:00:00,2874.15,10,5,hfefxneahqjjhfzxkoxqjqp
3748848,10,10,3000,19,96498,1970-01-01 00:00:00,5730.80,10,5,hytcvvkpsxyuzimaffbesvm

In [28]:
stock = pd.read_csv('stock.csv', header=None)

In [29]:
stock.columns = ['s_w_id', 's_i_id', 's_quantity', 's_ytd', 's_order_cnt', 's_remote_cnt', 's_dist_01', 's_dist_02', 's_dist_03', 's_dist_04', 's_dist_05',
                's_dist_06','s_dist_07', 's_dist_08', 's_dist_09', 's_dist_10', 's_data']

In [30]:
stock.isna().any()

s_w_id          False
s_i_id          False
s_quantity      False
s_ytd           False
s_order_cnt     False
s_remote_cnt    False
s_dist_01       False
s_dist_02       False
s_dist_03       False
s_dist_04       False
s_dist_05       False
s_dist_06       False
s_dist_07       False
s_dist_08       False
s_dist_09       False
s_dist_10       False
s_data          False
dtype: bool

In [5]:
stock = stock.astype({"s_ytd": int})

In [31]:
warehouse.to_csv('warehouse.csv', index=False)

In [32]:
district.to_csv('district.csv', index=False)

In [33]:
customer.to_csv('customer.csv', index=False)

In [6]:
orders.to_csv('order.csv', index=False)

In [35]:
item.to_csv('item.csv', index=False)

In [36]:
order_line.to_csv('order-line.csv', index=False)

In [7]:
stock.to_csv('stock.csv', index=False)

In [16]:
customer_order_items = order_line[['ol_w_id', 'ol_d_id', 'ol_o_id', 'ol_i_id']]

In [17]:
customer_order_items.columns = ['o_w_id', 'o_d_id', 'o_id', 'ol_i_id']

In [20]:
customer_order_items

         o_w_id  o_d_id  o_id  ol_i_id
0             1       1     1    20822
1             1       1     1    62266
2             1       1     1    47297
3             1       1     1    61218
4             1       1     1    57008
...         ...     ...   ...      ...
3748844      10      10  3000    58777
3748845      10      10  3000    91714
3748846      10      10  3000    43811
3748847      10      10  3000    98169
3748848      10      10  3000    96498

[3748849 rows x 4 columns]

In [22]:
customer_order_items = customer_order_items.groupby(['o_w_id','o_d_id','o_id'])['ol_i_id'].apply(list).reset_index(name='i_ids')

In [24]:
customer_order_items = pd.merge(customer_order_items, orders, on=['o_w_id', 'o_d_id', 'o_id'], how='left')

In [26]:
customer_order_items = customer_order_items[['o_w_id', 'o_d_id', 'o_id', 'i_ids', 'o_c_id']]

,o_w_id,o_d_id,o_id,i_ids,o_c_id
0,1,1,1,"[20822, 62266, 47297, 61218, 57008, 6735, 9337...",2607
1,1,1,2,"[3831, 97426, 34918, 42763, 5307, 6719, 19822,...",2123
2,1,1,3,"[79502, 91283, 12353, 72960, 77912, 38857, 779...",2637
3,1,1,4,"[61751, 27334, 39421, 28395, 36547, 91429, 719...",2748
4,1,1,5,"[18474, 71035, 38897, 73981, 5332, 12855, 6096...",1173
...,...,...,...,...,...
299995,10,10,2996,"[263, 48870, 34077, 16541, 89014, 81541, 48021...",2780
299996,10,10,2997,"[16123, 48045, 36594, 15601, 479, 61407, 60585...",1604
299997,10,10,2998,"[86256, 25358, 78055, 63727, 35195]",2126
299998,10,10,2999,"[26278, 18972, 95267, 73591, 72744, 46311, 733...",642
299999,10,10,3000,"[45290, 85076, 65154, 2703, 35090, 93633, 2457...",1314

In [28]:
customer_order_items.columns = [['coi_w_id', 'coi_d_id', 'coi_o_id', 'coi_i_ids', 'coi_c_id']]

In [29]:
customer_order_items

,coi_w_id,coi_d_id,coi_o_id,coi_i_ids,coi_c_id
0,1,1,1,"[20822, 62266, 47297, 61218, 57008, 6735, 9337...",2607
1,1,1,2,"[3831, 97426, 34918, 42763, 5307, 6719, 19822,...",2123
2,1,1,3,"[79502, 91283, 12353, 72960, 77912, 38857, 779...",2637
3,1,1,4,"[61751, 27334, 39421, 28395, 36547, 91429, 719...",2748
4,1,1,5,"[18474, 71035, 38897, 73981, 5332, 12855, 6096...",1173
...,...,...,...,...,...
299995,10,10,2996,"[263, 48870, 34077, 16541, 89014, 81541, 48021...",2780
299996,10,10,2997,"[16123, 48045, 36594, 15601, 479, 61407, 60585...",1604
299997,10,10,2998,"[86256, 25358, 78055, 63727, 35195]",2126
299998,10,10,2999,"[26278, 18972, 95267, 73591, 72744, 46311, 733...",642
299999,10,10,3000,"[45290, 85076, 65154, 2703, 35090, 93633, 2457...",1314

In [31]:
customer_order_items.to_csv('customer_order_items.csv', index=False)